Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/2.0.37/edc/ATSAML11E16A.PIC
      <edc:DCRDef edc:_addr="0x804014" edc:access="----------------------------nnnn" edc:cname="USER_WORD_5" edc:default="0x00000000" edc:factorydefault="0x00000000" edc:impl="0xF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NONSECB_IDAU" edc:desc="IDAU Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECB_DSU" edc:desc="DSU Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECB_NVMCTRL" edc:desc="NVMCTRL Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECB_DMAC" edc:desc="DMAC Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x804018" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="USER_WORD_6" edc:default="0x00000000" edc:factorydefault="0x00000000" edc:impl="0x3FFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NONSECC_EVSYS" edc:desc="EVSYS Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_SERCOM0" edc:desc="SERCOM0 Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_SERCOM1" edc:desc="SERCOM1 Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_SERCOM2" edc:desc="SERCOM2 Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TC0" edc:desc="TC0 Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TC1" edc:desc="TC1 Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TC2" edc:desc="TC2 Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_ADC" edc:desc="ADC Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_DAC" edc:desc="DAC Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_PTC" edc:desc="PTC Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TRNG" edc:desc="TRNG Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_CCL" edc:desc="CCL Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_OPAMP" edc:desc="OPAMP Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TRAM" edc:desc="TRAM Non-Secure" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80401C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USER_WORD_7" edc:default="0x8433651E" edc:factorydefault="0x8433651E" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_USERCRC" edc:desc="CRC for USER[1,2,3] DWORDS" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector atdf:pagesize="0x40" edc:beginaddr="0x804020" edc:endaddr="0x804100" edc:erasepagesize="0x100" edc:regionid="userid"/>
    <edc:ConfigFuseSector atdf:pagesize="0x40" edc:beginaddr="0x80C000" edc:endaddr="0x80C100" edc:erasepagesize="0x100" edc:regionid="BOCOR_FUSES">
      <edc:DCRDef edc:_addr="0x80C000" edc:access="nnnnnnnn--nnnnnnnnnnnnnn--------" edc:cname="BOCOR_WORD_0" edc:default="0xA0C000FF" edc:factorydefault="0xA0C000FF" edc:impl="0xFF3FFF00" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:DCRFieldDef edc:cname="IDAU_BS" edc:desc="Boot Secure" edc:nzwidth="0x8"/>
            <edc:DCRFieldDef edc:cname="IDAU_BNSC" edc:desc="Boot Non-Secure Callable" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="BOOTROM_BOOTOPT" edc:desc="Boot Option" edc:nzwidth="0x8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
