Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/2.0.37/edc/ATSAML11E16A.PIC
      <edc:SFRDef edc:_addr="0xE002EFD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB_NS"/>
      <edc:SFRDef edc:_addr="0xE002EFD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB_NS"/>
      <edc:SFRDef edc:_addr="0xE002EFDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB_NS"/>
      <edc:SFRDef edc:_addr="0xE002EFE0" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="PART_0" edc:desc="Part number bits[7:0]" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFE4" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="PART_1" edc:desc="Part number bits[11:8]" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DES_0" edc:desc="JEP106 identification code bits [3:0]" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFE8" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR2" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="DES_1" edc:desc="JEP106 identification code bits[6:4]" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="JEDEC" edc:desc="JEDEC assignee value is used" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Component revision" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFEC" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR3" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="CMOD" edc:desc="Customer Modified" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="RevAnd" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFF0" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFF4" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR1" edc:impl="0xFF" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:desc="CoreSight component class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFF8" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EFFC" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="DIB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB_NS">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:regionid="SCS"/>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x42003600" edc:regionid="PERIPHERALS">
      <edc:SFRDef edc:_addr="0x40000000" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRCTRL" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Peripheral identifier" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Peripheral access control key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="LOCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
