Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/2.0.37/edc/ATSAML11E16A.PIC
      <edc:AdjustPoint edc:_addr="0x40003424" edc:offset="0xFFCBDD"/>
      <edc:SFRDef edc:_addr="0x41000001" edc:access="-----n--" edc:cname="SECCTRL" edc:impl="0x4" edc:mclr="00000011" edc:nzwidth="0x8" edc:por="00000011" ltx:memberofperipheral="IDAU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IDAU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXN" edc:desc="CPU RAM is eXecute Never" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41000002" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41000004" edc:access="--------nnnnnnnn--nnnnnnnnnnnnnn" edc:cname="SCFGB" edc:impl="0xFF3FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="IDAU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IDAU">
            <edc:SFRFieldDef edc:cname="BS" edc:desc="Boot Secure" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="BNSC" edc:desc="Boot Secure, Non-secure Callable" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTPROT" edc:desc="Boot Protection" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000008" edc:access="------------nnnn--nnnnnnnnnnnnnn" edc:cname="SCFGA" edc:impl="0xF3FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="IDAU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IDAU">
            <edc:SFRFieldDef edc:cname="AS" edc:desc="Application Secure" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ANSC" edc:desc="Application Secure, Non-secure Callable" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DS" edc:desc="DATAFLASH Data Secure" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100000C" edc:access="-nnnnnnn" edc:cname="SCFGR" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="IDAU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IDAU">
            <edc:SFRFieldDef edc:cname="RS" edc:desc="RAM Secure" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100000D" edc:offset="0x1FF3"/>
      <edc:SFRDef edc:_addr="0x41002000" edc:access="----ww-w" edc:cname="CTRL" edc:impl="0xD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC" edc:desc="32-bit Cyclic Redundancy Code" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MBIST" edc:desc="Memory built-in self-test" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002001" edc:access="--nnnnnn" edc:cname="STATUSA" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Done" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRSTEXT" edc:desc="CPU Reset Phase Extension" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BERR" edc:desc="Bus Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAIL" edc:desc="Failure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Protection Error Detected by the State Machine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BREXT" edc:desc="BootRom Phase Extension" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002002" edc:access="rrrrrrrr" edc:cname="STATUSB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DAL" edc:desc="Debugger Access Level" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SECURED" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NS_DEBUG" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULL_DEBUG" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:desc="Debugger Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:desc="Hot-Plugging Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:desc="Debug Communication Channel 0 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:desc="Debug Communication Channel 1 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCCD0" edc:desc="Boot ROM Communication Channel 0 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCCD1" edc:desc="Boot ROM Communication Channel 1 Dirty" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41002003" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x41002004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="AMOD" edc:desc="Access Mode" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
